# src/telegram/messages.py

from typing import Final

# === Общие ===
ACTION_CANCELED: Final = "Действие отменено"
ACCESS_DENIED: Final = "Доступ запрещён."

# === Админ-панель ===
ADMIN_PANEL_TITLE: Final = "Панель администратора:"
USER_CONTROL_TITLE: Final = "Управление пользователями:"
BILLING_CONTROL_TITLE: Final = "Управление биллингом:"

# === CRUD-операции ===
ADD_BUTTON: Final = "➕ Изменить"
EDIT_BUTTON: Final = "✏️ Изменить"
DELETE_BUTTON: Final = "❌ Удалить"
BACK_BUTTON: Final = "🔙 Назад"

# === Пользователи ===
USER_NOT_REGISTERED: Final = "Вы не зарегистрированы."
NAME_NOT_UNIQUE: Final = "Имя не уникально. Введите другое имя:"
USER_LIST_EMPTY: Final = "Нет пользователей."
USER_LIST_HEADER: Final = "Список пользователей:\n\n"
USER_LIST_STATUS_ACTIVE: Final = "✅"
USER_LIST_STATUS_INACTIVE: Final = "❌"
USER_LIST_ROW: Final = "{status} {name} ({user_id})\n"
USER_PROFILE_TEMPLATE: Final = (
    "<b>{name}</b> ({user_id})\n"
    "{sep}\n"
    "Статус: {status}\n"
    "Начало: {start_date}\n"
    "Конец: {end_date}\n"
)
USER_ADDED_SUCCESS: Final = (
    "<b>{name}</b> ({user_id})\n"
    "{sep}\n"
    "✅ Пользователь успешно добавлен."
)
USER_ADDED_ERROR: Final = (
    "<b>{name}</b> ({user_id})\n"
    "{sep}\n"
    "❌ Ошибка при добавлении пользователя."
)
USER_DELETED_SUCCESS: Final = (
    "<b>{name}</b> ({user_id})\n"
    "{sep}\n"
    "✅ Пользователь успешно удален."
)
USER_DELETED_ERROR: Final = (
    "<b>{name}</b> ({user_id})\n"
    "{sep}\n"
    "❌ Ошибка при удалении пользователя."
)

ENTER_USER_ID: Final = "Введите ID пользователя:"
USER_ID_NOT_NUMBER: Final = "ID должен быть числом. Введите ID пользователя:"
USER_EXISTS: Final = "⚠️ Пользователь {user_id} уже существует"
USER_NOT_FOUND: Final = "⚠️ Пользователь {user_id} не найден"

ENTER_NAME: Final = "Введите имя пользователя"
NAME_EMPTY: Final = "⚠️ Имя не может быть пустым. Введите имя пользователя:"
NAME_TOO_LONG: Final = "⚠️ Имя должно быть не длиннее 25 символов. Введите имя пользователя:"

REG_USER_CONFIRM: Final = "🛎️ Отправить запрос администратору?"
REG_ADMIN_CONFIRM: Final = ("{name} ({user_id})\n\n"
                            "🛎️ Запрос на регистрацию:")
REG_REQUEST_SENT: Final = "ℹ️ Запрос отправлен администратору."
REG_SUCCESS_ADMIN: Final = "✅ Пользователь успешно добавлен."
REG_SUCCESS_USER: Final = "✅ Подтверждение получено. Вы успешно зарегистрированы!"
REG_ERROR_ADMIN: Final = "❌ Ошибка добавления пользователя в базу."
REG_ERROR_USER: Final = "❌ Возникла ошибка при регистрации."
REG_REJECTED_ADMIN: Final = "❌ Регистрация пользователя {user_id} отклонена."
REG_REJECTED_USER: Final = "❌ Администратор отклонил ваш запрос."

USER_DELETE_CONFIRM: Final = "Удалить пользователя {name} ({user_id})?"

# === Транзакции ===
ENTER_TX_ID: Final = "Введите ID транзакции:"
TX_ID_NOT_NUMBER: Final = "⚠️ ID должен быть целым числом. Введите ID транзакции:"
TX_ID_NOT_POSITIVE: Final = " ⚠️ ID должен положительным числом. Введите ID транзакции:"
ENTER_AMOUNT: Final = "Введите сумму транзакции"
AMOUNT_INVALID: Final = "⚠️ Сумма должна быть целым числом.\nВведите сумму транзакции:"
AMOUNT_INVALID_RULE: Final = "⚠️ Сумма должна быть больше нуля и кратна 100 рублям.\nВведите сумму транзакции:"
TX_NOT_FOUND: Final = "⚠️ Транзакция {tx_id} не найдена."

TX_LIST_EMPTY: Final = "Нет транзакций."
TX_LIST_HEADER: Final = (
    "📋 Список транзакций:\n\n"
    "<pre> id | Сумма | Пользователь\n</pre>"
    "<pre>----------------------------\n</pre>"
)
TX_LINE_TEMPLATE: Final = "<pre>{tx_id:03d} | {amount: 5d} | {name}\n</pre>"

TX_ADDED_SUCCESS: Final = (
    "{tx_id} {amount} {name}\n\n"
    "✅ Транзакция успешно добавлена."
)
TX_ADDED_ERROR: Final = (
    "{tx_id} {amount} {name}\n"
    "❌ Ошибка при добавлении транзакции."
)
TX_DELETE_CONFIRM: Final = (
	"{tx_id} {amount} {name}\n\n"
	"Удалить транзакцию?"
)
TX_DELETED_SUCCESS: Final = "Транзакция {tx_id} успешно удалена."
TX_DELETED_ERROR: Final = "Ошибка при удалении транзакции {tx_id}."

# === Статистика ===
STATS_TEMPLATE: Final = (
    "Системная статистика:\n\n"
    "👤 Всего пользователей: {users_total_count}\n"
    "✅ Активных: {users_active}\n"
    "⌛ Просроченных: {users_expired}\n"
    "❌ Заблокированных: {users_blocked}\n\n"
	"📋 Всего транзакций: {tx_total_count}\n"
	"💰 Сумма транзакций: {tx_total_amount}"
)


# === В разработке ===
FEATURE_IN_DEV: Final = "Функция в разработке"

# Вспомогательная строка-разделитель
SEP: Final = "-" * 35